// Operator[연산] : something을 토큰에 의해서 새로운거 만들기
// token[토큰] : 기호들
// ex) 
// 사칙연산 : +, - , *
// 논리연산 : !, &&, ||, ..........................

// 수리연산[arithmath]
// 1+2 => 더하기 연산
// 1-2 => 빼기 연산
// 1*2 => 곱하기 연산
// 1**2 => 제곱 연산자
// 3/2 => 나누기 연산자
// 3%2 => 나머지 연산자

// 10 + "10" = 1010 => 문자열 연결 연산 -> 암묵적 캐스팅 (문자열로 바뀜)
// +"100" => 100 => 단항 덧셈 연산 -> 암묵적 캐스팅 (숫자로 바뀜)

// 대입 연산
// const a = 10 => 10을 변수 a에 복사한다.

// 비교 연산(>, <, =>, <=, ==, !=) => 반환형 boolean타입
// 5 > 3 => true

// 논리 연산
// and => && (모든 조건이 성립하면 true를 반환)
// or => || (하나라도 성립하면 true를 반환)
// not => ! (true면 false를 반환함)


// 삼항 연산자
// const d1 = 5 > 3 ? "장원영" : "아이유" => "장원영"
// 비교하여 true면 "장원영"을 반환
// false면 "아이유"를 반환

